### Import Data

In [1]:
import pandas as pd

In [2]:
sales_path = "/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 8 Wide and Narrow Data/Data8/sales_by_employee.csv"

In [3]:
df_sales = pd.read_csv(sales_path, parse_dates=['Date'])
print(df_sales.head())

        Date   Name       Customer  Revenue  Expenses
0 2020-01-01  Oscar  Logistics XYZ     5250       531
1 2020-01-01  Oscar    Money Corp.     4406       661
2 2020-01-02  Oscar     PaperMaven     8661      1401
3 2020-01-03  Oscar    PaperGenius     7075       906
4 2020-01-04  Oscar    Paper Pound     2524      1767

/var/folders/pg/x6kyk1l92fj8q4332g1j8rnw0000gp/T/ipykernel_15373/3130922123.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_sales = pd.read_csv(sales_path, parse_dates=['Date'])

### Pivot Table

In [26]:
df_sales.nunique()

Date         5
Name         5
Customer     7
Revenue     26
Expenses    26
dtype: int64

In [18]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      26 non-null     datetime64[ns]
 1   Name      26 non-null     object
 2   Customer  26 non-null     object
 3   Revenue   26 non-null     int64
 4   Expenses  26 non-null     int64
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 1.1+ KB

**If your dataframe includes an object type of column, point out specific columns**

In [19]:
df_sales.pivot_table(index="Date", values=['Revenue','Expenses'])

               Expenses      Revenue
Date
2020-01-01   637.500000  4293.500000
2020-01-02  1244.400000  7303.000000
2020-01-03  1313.666667  4865.833333
2020-01-04  1450.600000  3948.000000
2020-01-05  1196.250000  4834.750000

**Identify operation**

In [20]:
df_sales.pivot_table(index="Date", values=['Revenue','Expenses'], aggfunc='mean')

               Expenses      Revenue
Date
2020-01-01   637.500000  4293.500000
2020-01-02  1244.400000  7303.000000
2020-01-03  1313.666667  4865.833333
2020-01-04  1450.600000  3948.000000
2020-01-05  1196.250000  4834.750000

In [21]:
df_sales.pivot_table(index="Date", values=['Revenue','Expenses'], aggfunc='sum')

            Expenses  Revenue
Date
2020-01-01      3825    25761
2020-01-02      6222    36515
2020-01-03      7882    29195
2020-01-04      7253    19740
2020-01-05      4785    19339

**Create pivot table using columns**

In [22]:
print(df_sales.pivot_table(index="Date",columns='Name', values='Revenue', aggfunc='sum'))

Name          Creed   Dwight     Jim  Michael   Oscar
Date
2020-01-01   4430.0   2639.0  1864.0   7172.0  9656.0
2020-01-02  13214.0      NaN  8278.0   6362.0  8661.0
2020-01-03      NaN  11912.0  4226.0   5982.0  7075.0
2020-01-04   3144.0      NaN  6155.0   7917.0  2524.0
2020-01-05    938.0   7771.0     NaN   7837.0  2793.0

**Replace NaN with fill_value=0**

In [23]:
print(df_sales.pivot_table(index="Date",columns='Name', values='Revenue', aggfunc='sum', fill_value=0))

Name        Creed  Dwight   Jim  Michael  Oscar
Date
2020-01-01   4430    2639  1864     7172   9656
2020-01-02  13214       0  8278     6362   8661
2020-01-03      0   11912  4226     5982   7075
2020-01-04   3144       0  6155     7917   2524
2020-01-05    938    7771     0     7837   2793

**Summarize outcomes with margins=True**

In [24]:
print(df_sales.pivot_table(index="Date",columns='Name', values='Revenue', aggfunc='sum', fill_value=0, margins=True))

Name                 Creed  Dwight    Jim  Michael  Oscar     All
Date
2020-01-01 00:00:00   4430    2639   1864     7172   9656   25761
2020-01-02 00:00:00  13214       0   8278     6362   8661   36515
2020-01-03 00:00:00      0   11912   4226     5982   7075   29195
2020-01-04 00:00:00   3144       0   6155     7917   2524   19740
2020-01-05 00:00:00    938    7771      0     7837   2793   19339
All                  21726   22322  20523    35270  30709  130550

**Summarize outcomes with margins=Total**

In [25]:
print(df_sales.pivot_table(index="Date",columns='Name', values='Revenue', aggfunc='sum', fill_value=0, margins='Total'))

Name                 Creed  Dwight    Jim  Michael  Oscar     All
Date
2020-01-01 00:00:00   4430    2639   1864     7172   9656   25761
2020-01-02 00:00:00  13214       0   8278     6362   8661   36515
2020-01-03 00:00:00      0   11912   4226     5982   7075   29195
2020-01-04 00:00:00   3144       0   6155     7917   2524   19740
2020-01-05 00:00:00    938    7771      0     7837   2793   19339
All                  21726   22322  20523    35270  30709  130550

### Additional Options for Pivot Tables

**Count employee sales**

In [27]:
print(df_sales.pivot_table(index="Date",columns='Name', values='Revenue', aggfunc='count', fill_value=0))

Name        Creed  Dwight  Jim  Michael  Oscar
Date
2020-01-01      1       1    1        1      2
2020-01-02      2       0    1        1      1
2020-01-03      0       3    1        1      1
2020-01-04      1       0    2        1      1
2020-01-05      1       1    0        1      1

**Use two operations**

In [28]:
print(df_sales.pivot_table(index="Date",columns='Name', values='Revenue', aggfunc=['count','sum'], fill_value=0))

           count                             sum
Name       Creed Dwight Jim Michael Oscar  Creed Dwight   Jim Michael Oscar
Date
2020-01-01     1      1   1       1     2   4430   2639  1864    7172  9656
2020-01-02     2      0   1       1     1  13214      0  8278    6362  8661
2020-01-03     0      3   1       1     1      0  11912  4226    5982  7075
2020-01-04     1      0   2       1     1   3144      0  6155    7917  2524
2020-01-05     1      1   0       1     1    938   7771     0    7837  2793

**Different operations in different columns**

In [32]:
print(df_sales.pivot_table(index="Date",columns='Name', values=['Expenses','Revenue'], aggfunc={'Expenses': 'max', 'Revenue': 'min'}, fill_value=0))

           Expenses                            Revenue                       \
Name          Creed Dwight   Jim Michael Oscar   Creed Dwight   Jim Michael
Date
2020-01-01      548    368  1305     412   661    4430   2639  1864    7172
2020-01-02     1906      0   462     685  1401    5188      0  8278    6362
2020-01-03        0   1321  1923    1772   906       0   2703  4226    5982
2020-01-04     1314      0  1889    1857  1767    3144      0  2287    7917
2020-01-05     1053   1475     0    1633   624     938   7771     0    7837


Name       Oscar
Date
2020-01-01  4406
2020-01-02  8661
2020-01-03  7075
2020-01-04  2524
2020-01-05  2793

In [33]:
df_sales.pivot_table(index="Date",columns='Name', values=['Expenses','Revenue'], aggfunc={'Expenses': 'max', 'Revenue': 'min'}, fill_value=0)

           Expenses                            Revenue                       \
Name          Creed Dwight   Jim Michael Oscar   Creed Dwight   Jim Michael
Date
2020-01-01      548    368  1305     412   661    4430   2639  1864    7172
2020-01-02     1906      0   462     685  1401    5188      0  8278    6362
2020-01-03        0   1321  1923    1772   906       0   2703  4226    5982
2020-01-04     1314      0  1889    1857  1767    3144      0  2287    7917
2020-01-05     1053   1475     0    1633   624     938   7771     0    7837


Name       Oscar
Date
2020-01-01  4406
2020-01-02  8661
2020-01-03  7075
2020-01-04  2524
2020-01-05  2793

**Use multiIndex**

In [36]:
print(df_sales.pivot_table(index=["Name", "Date"], values="Revenue", aggfunc="sum").head(10))

                   Revenue
Name   Date
Creed  2020-01-01     4430
       2020-01-02    13214
       2020-01-04     3144
       2020-01-05      938
Dwight 2020-01-01     2639
       2020-01-03    11912
       2020-01-05     7771
Jim    2020-01-01     1864
       2020-01-02     8278
       2020-01-03     4226

**Replace levels**

In [37]:
print(df_sales.pivot_table(index=["Date", "Name"], values="Revenue", aggfunc="sum").head(10))

                    Revenue
Date       Name
2020-01-01 Creed       4430
           Dwight      2639
           Jim         1864
           Michael     7172
           Oscar       9656
2020-01-02 Creed      13214
           Jim         8278
           Michael     6362
           Oscar       8661
2020-01-03 Dwight     11912

### Stacking and Unstacking Index Levels

In [42]:
by_name_and_date = df_sales.pivot_table(index="Name", columns = 'Date', values="Revenue", aggfunc="sum", fill_value=0)

In [48]:
print(by_name_and_date.head())

Date     2020-01-01  2020-01-02  2020-01-03  2020-01-04  2020-01-05
Name
Creed          4430       13214           0        3144         938
Dwight         2639           0       11912           0        7771
Jim            1864        8278        4226        6155           0
Michael        7172        6362        5982        7917        7837
Oscar          9656        8661        7075        2524        2793

**Change axis for index using Stack()**

In [49]:
print(by_name_and_date.stack().head(10))

Name    Date
Creed   2020-01-01     4430
        2020-01-02    13214
        2020-01-03        0
        2020-01-04     3144
        2020-01-05      938
Dwight  2020-01-01     2639
        2020-01-02        0
        2020-01-03    11912
        2020-01-04        0
        2020-01-05     7771
dtype: int64

**Change axis for index using Unstack()**

In [46]:
print(by_name_and_date.T)

Name        Creed  Dwight   Jim  Michael  Oscar
Date
2020-01-01   4430    2639  1864     7172   9656
2020-01-02  13214       0  8278     6362   8661
2020-01-03      0   11912  4226     5982   7075
2020-01-04   3144       0  6155     7917   2524
2020-01-05    938    7771     0     7837   2793

In [57]:
sales_by_customer = df_sales.pivot_table(
index = ["Customer", "Name"],
values = "Revenue",
aggfunc = "sum",
fill_value=0
)

In [58]:
print(sales_by_customer.head(10))

                           Revenue
Customer          Name
Average Paper Co. Creed      13214
                  Jim         2287
Best Paper Co.    Dwight      2703
                  Michael    15754
Logistics XYZ     Dwight      9209
                  Michael     7172
                  Oscar       5250
Money Corp.       Creed       5368
                  Jim         8278
                  Oscar       4406

In [60]:
print(sales_by_customer.unstack().head(10))

                   Revenue
Name                 Creed  Dwight     Jim  Michael   Oscar
Customer
Average Paper Co.  13214.0     NaN  2287.0      NaN     NaN
Best Paper Co.         NaN  2703.0     NaN  15754.0     NaN
Logistics XYZ          NaN  9209.0     NaN   7172.0  5250.0
Money Corp.         5368.0     NaN  8278.0      NaN  4406.0
Paper Pound            NaN  7771.0  4226.0      NaN  5317.0
PaperGenius            NaN  2639.0  1864.0  12344.0  7075.0
PaperMaven          3144.0     NaN  3868.0      NaN  8661.0